app/controllers/message_controller.rb

SELECT "messages".* FROM "messages"
---
  def list
    @messages = Message.all

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("about_meeting", "attendee", "created_at", "end_date", "end_time", "minute_taker", "note", "owner", "place", "project", "start_date", "start_time", "title", "topic", "type_o", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # Instantiate a new object using form parameters
    @message = Message.new(params[:message])
    # Save the object
    if  @message.save

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "6"]]
---
  def delete
   # @message = Message.find(params[:id])
    @message = Message.find(params[:id]).destroy